INSERT INTO store_tb (name, user_id)
VALUES
('기가 막히는 한정식', 1),
('기가 안막히는 양식', 1);

-- 첫 번째 제품 삽입
INSERT INTO product_tb (id, product_code, name, category, price, store_id)
VALUES (1, 111, '김치찌개', '메인', 9900, 1),
(2, 112, '된장찌개', '메인', 8500, 1);

INSERT INTO ingredient_tb (name, amount, unit, product_id)
-- 김치찌개
VALUES
('김치', 200, 'G', 1),
('돼지고기', 150, 'G', 1),
('두부', 100, 'G', 1),
('고춧가루', 10, 'G', 1),
('마늘', 5, 'G', 1),
-- 된장찌개
('된장', 50, 'G', 2),
('두부', 100, 'G', 2),
('애호박', 80, 'G', 2),
('양파', 50, 'G', 2),
('버섯', 70, 'G', 2);

INSERT INTO material_tb (name, amount, unit, sub_amount, sub_unit, store_id)
VALUES
('소금', 1.0, 'KG', 1000.0, 'G', 1),
('김치', 0.5, 'KG', 500.0, 'G', 1),
('돼지고기', 1.5, 'KG', 1500.0, 'G', 1),
('두부', 1.0, 'EA', 500.0, 'G', 1),
('고춧가루', 0.1, 'KG', 100.0, 'G', 1),
('마늘', 200.0, 'G', 200.0, 'G', 1),
('된장', 0.3, 'KG', 300.0, 'G', 1),
('애호박', 2.0, 'EA', 200.0, 'G', 1),
('양파', 2.0, 'EA', 300.0, 'G', 1),
('버섯', 0.5, 'KG', 500.0, 'G', 1);

INSERT INTO material_order_tb (name, price, amount, unit, sub_amount, sub_unit, supplier, receipt_date, material_id)
VALUES
('소금', 1000, 1.0, 'KG', 1000.0, 'G', 'Supplier A', '2024-10-12 09:00:00', 1),
('김치', 5000, 0.5, 'KG', 500.0, 'G', 'Supplier B', '2024-10-13 10:00:00', 2),
('돼지고기', 15000, 1.5, 'KG', 1500.0, 'G', 'Supplier C', '2024-10-14 11:00:00', 3),
('두부', 2000, 1.0, 'EA', 500.0, 'G', 'Supplier D', '2024-10-14 12:00:00', 4),
('고춧가루', 3000, 0.1, 'KG', 100.0, 'G', 'Supplier E', '2024-10-15 13:00:00', 5),
('마늘', 1000, 200.0, 'G', 200.0, 'G', 'Supplier F', '2024-10-16 14:00:00', 6),
('된장', 4000, 0.3, 'KG', 300.0, 'G', 'Supplier G', '2024-10-17 15:00:00', 7),
('애호박', 1500, 2.0, 'EA', 200.0, 'G', 'Supplier H', '2024-10-18 16:00:00', 8),
('양파', 1200, 2.0, 'EA', 300.0, 'G', 'Supplier I', '2024-10-19 17:00:00', 9),
('버섯', 2500, 0.5, 'KG', 500.0, 'G', 'Supplier J', '2024-10-20 18:00:00', 10);
